package action14.task02;

/*
 * Задача 2.
 Создать класс Server и класс Client. 
 В этих классах должен метод start, который выводит сообщение, что сервер/клиент запустился и метод останавливается(работает без цикла).
 В приложении должен стартануть сервер и 2 клиента(не в цикле).
 Добавить сквозную функциональность, чтобы перед стартом сервера и стартом клиентов выводится в консоль информация, что такой-то класс пытается запуститься.
 (example action17_spring2)
 */

public class MyApp {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
